// miniprogram/pages/campusQ&A/CampusQ&A.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    QAList: [{
        Q: "去哪里补办学生证呢？",
        A: "明德一楼教务处。登报纸在东苑丰巢。"
      },
      {
        Q: "去哪里补办校园卡呢？",
        A: "行政楼一楼，带学生证、现金。"
      }, {
        Q: "去哪里补办门禁卡呢？",
        A: "各宿舍区负责主管，可以问宿管阿姨。"
      }, {
        Q: "开学的时候，校园卡失效怎么办？",
        A: "去食堂刷卡机多刷几次就可以了，不需要消费。如果还是没有用，去行政楼一楼充磁。"
      }, {
        Q: "哪里可以配钥匙呢？",
        A: "浦江楼下找宿管阿姨。"
      }, {
        Q: "学校干洗店在哪呢？",
        A: "象山文具店、同和后门、浦江理发店旁边。"
      }, {
        Q: "学校修手机、电脑的地方？",
        A: "象山维修点、生工楼、龙华。"
      }, {
        Q: "学校附近的眼镜店在哪呢？",
        A: "浦江楼旁边、象山水榭、慕斯荟一楼、龙华美食街。"
      }, {
        Q: "哪里可以租正装呢？",
        A: "大学生活动中心楼下孵化园、慕斯荟。"
      }, {
        Q: "学校的心理咨询室在哪？",
        A: "明德楼，预约电话：58139093。"
      }, {
        Q: "长跑申诉怎么弄？",
        A: "体育馆133，每周一、四、五，下午三点到四点。"
      },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})